cf/InformationRegisters/Tradeware.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Tradeware</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Parameters</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Model</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Computer</Name>
					<Comment>Coputer to which connected device</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Use</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Identifier</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/AlertType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>AlertType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Warning</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Error</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/InformationRegisters/Tradeware/Ext/RecordSetModule.bsl
Procedure BeforeWrite(Cancel, Replacing)

	If DataExchange.Load Then
		Return;
	EndIf;

	Record = Undefined;
	For Each Record In ThisObject Do
		If NOT ValueIsFilled(Record.Identifier) AND NOT ValueIsFilled(Record.Model)
			 AND NOT ValueIsFilled(Record.Parameters) AND NOT ValueIsFilled(Record.Computer) Then
			Alerts.AddAlert(Nstr("en='Not specified service processor!';pl='Obróbka serwisowa nie jest określiona!'; ru='Не выбрана сервисная обработка!'"),Enums.AlertType.Error,Cancel,ThisObject);
			Break;
		EndIf;
		Record.Use = True;
	EndDo;

EndProcedure // BeforeWrite()
